app/graphql/mutations/create_user.rb

    def resolve(name: nil, email: nil, password: nil)
      User.create!(
        name: name,
        email: email,
        password: password
      )
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"