app/graphql/mutations/sign_in_user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Bryanrattanavong@gmail.com"], ["LIMIT", 1]]
---
    def resolve(email: nil, password: nil)

      unless user = User.find_by(email:email)